import React, { useState } from "react";
import AppModal from "@/common/AppModal";
import { Grid, Typography } from "@mui/material";
import Appcheckbox from "@/common/Appcheckbox";
import Appbutton from "@/common/Appbutton";
import ModalRegulation from "@/libs/ModalRgulation";
type Props = {
  open: boolean;
  onClose: () => void;
  onSubmit?: () => void;
  textButton?: string;
  title: string | undefined;
};

export default function Regulation({
  open,
  onClose,
  onSubmit,
  textButton,
  title,
}: Props) {
  return (
    <ModalRegulation
      title={title}
      open={open}
      onClose={onClose}
      onSubmit={onSubmit}
      textButton={textButton}
    >
      <Typography variant="h5">
        استفاده شما از سایت اینترنتی تالار ملک” و سفارش از این پایگاه به معنی
        توافق کامل شما با شرایط و ضوابط ذیل تلقی می گردد:
        <br /> استفاده از خدمات از فروشگاه اینترنتی تالار ملک بر مبنای قوانین
        استفاده از خدمات از فروشگاه اینترنتی تالار ملک بر مبنای قوانین و آئین
        نامه های موجود در مورد تجارت الکترونیک و با رعایت کامل تمام قوانین
        جمهوری اسلامی ایران صورت می پذیرد.
        <br />
        1- اطلاعاتی که توسط کاربران ارائه می‌شوند.
        <br />
        2- اطلاعاتی که توسط املاک ارائه میشود.
        <br />
        از این رو سایت اینترنتی تالار ملک مسوولیتی در قبال اطلاعات و محتوای مبهم
        و یا خطاهای نگارشی احتمالی برعهده نخواهد داشت. ولی با هدف ارائه خدمات
        بهتر و آگاه‌سازی مشتریان، خود را در بروزرسانی مداوم اطلاعات و محتویات
        متعهد می‌داند.
        <br />
        فروشگاه سایت اینترنتی تالار ملک هیچ گونه مسئولیتی را در مورد کارکرد سایت
        که می تواند ناشى از عواملی که خارج از سیطره مدیریت این سایت (همانند نقص
        اینترنت، مسائل مخابراتى، تجهیزات سخت افزاری و غیره) نمی پذیرد.
        <br />
        سایت اینترنتی تالار ملک به هیچ وجه اطلاعات منحصر بفرد کاربران را به
        اشخاص و طرفین غیر، واگذار نخواهد کرد و ضمنا با استفاده از آخرین فن آوری
        ها متعهد است حتی المقدور از حریم شخصی کاربران دفاع کند.
        <br />
        خدمات و محتویات سایت، صرفا براى استفاده شخصى شما عرضه شده است. هر گونه
        سوء استفاده از این اطلاعات پیگرد قانونی خواهد داشت و هیچ فرد حقیقی،
        حقوقی یا سایتی به هیچ عنوان نمی تواند از اطلاعات و محتویات موجود در سایت
        براى فروش، تولید مجدد یا ایجاد ترافیک در سایت خود استفاده نماید. اگر
        مایلید از سرویسها و محتویات سایت جهت مقاصد تجارى استفاده نمایید ، لازم
        است از قبل به ما اطلاع دهید. براى این کار لطفا با ما تماس بگیرید.
        <br />
        کاربران باید هنگام ثبت نام احراز هویت و احراز مالکیت شوند و فرم اطلاعات
        را صحیح و به طور کامل پر نمایند. بدیهی است درصورت ورود اطلاعات ناقص یا
        نادرست، مسئولیت به عهده کاربر است.
        <br />
        مالکیت معنوی محتویات سایت اینترنتی تالار ملک شامل قانون حق تکثیر بوده و
        متعلق به سایت اینترنتی تالار ملک می باشد.
        <br />
        در ابتدا اعلامیه ای از جانب ارائه دهنده ملک ، به عنوان مثال فروشنده یا
        موجر در سایت قرار میگیرد که در آن تمامی شرایط مورد پذیرش خویش از قبیل
        مبلغ و نحوه پرداخت و نقدی یا اقساط و شرایط ایجاد حق فسخ و تعهدات طرفین و
        شرایط جامع قرارداد مربوط در آن قید گردیده است و خریدار یا مستاجر نیز بعد
        قبول ایجاب فروشنده یا موجر اقدام به تایید و امضای این ایجاب مینماید که
        به معنی امضای قطعی قرارداد میباشد.
        <br />
        ارزش املاک سفارش داده شده طبق فهرست اعلامی فروشنده میباشد و شامل کلیه
        مالیات ها و عوارض فروش خواهد بود. هزینه مالیات بر ارزش افزوده نیز در
        قیمت لحاظ میشود. شرایط فسخ قرارداد:
        <br />
        هرگونه نقص و عیب در ملک، باید در مدت 48 ساعت پس از دریافت امضای قرارداد
        حتی در روزهای تعطیل از طریق تلفن “22398674-021 “و یا ایمیل  
        rokh778@yahoo.com یا “فرم اعلام فسخ قرارداد (این فرم در کنترل پنل شما
        موجود است) به مرکز ارتباط مشتریان سایت و طرف قرارداد اطلاع داده شود تا
        مشکل فوراً بررسی و در صورت اثبات نقص، اقدامات لازم صورت پذیرد . بدیهی
        است پس از 48 ساعت هیچ اعتراضی پذیرفتنی نیست.
        <br />
        در صورتی که خریدار بخواهد ثمن معامله را به صورت اقساط پرداخت کند و در
        اعلامیه ایجاب فروشنده توافق خویش را اعلام کرده باشد میبایست اسناد تعهد
        آور را به نحو مقتضی دربازه زمانی مشخص به فروشنده برساند.
        <br />
        شرایط فسخ قرارداد مطابق اعلامیه فروش قروشنده میباشد که به تایید خریدار
        رسیده است. هزینه تعرفه خدمات سایت در ابتدا به تایید طرفین قرارداد رسیده
        است که سایت حق دارد مبلغ هزینه خویش را قبل از پرداخت به ذیفع وصل نماید و
        مانده به حساب ذینفع واریز میگردد و طرفین با قبول این شرایط اقدام به
        تنظیم قرارداد بین یکدیگر نموده اند.
        <br />
      </Typography>
    </ModalRegulation>
  );
}
